/********************************************************************************
  * 文 件 名: main.c
  * 版 本 号: 初版
  * 修改作者: Smoaflie
  * 修改日期: 2023年08月27日
  * 功能介绍: 使用51单片机测试AS608模块
  ******************************************************************************
  * 注意事项:	请在串口助手里模拟AS608收发数据
							该代码遵守 GPL3.0开源协议，仅供学习参考，禁止商用
*********************************************************************************/

#include <REGX52.H>
#include "AS608.h"
#include "UART.h"

int main(void)
{
	UART_Init(57600);
	Timer0Init();
	UART_SendStr("初始化完成");
	while(1)
	{
		
	}
	return 0;
}
